app/controllers/store_controller.rb

  def index
    #session[:counter] ||= 0     /*same as below */
    if session[:counter].nil?
      session[:counter] = 0
    end
    session[:counter] += 1
    @count = session[:counter]
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
      if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2010-02-07 01:16:55', 29.95, 4, 1, '2010-02-07 01:16:55')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('test2', '2010-02-07 01:33:47', 'cc', 'test2 addr', 'testemail', '2010-02-07 01:33:47')