app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    #@users = User.all
    @users = User.find(:all, :order => :name)

INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('Maureen Higgins', '602393040.193552639371991', '2010-02-07 03:11:24', '769f33132b73f6bf47a636fcf68e6ad5e4e745d7', '2010-02-07 03:11:24')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save